import { title } from "process"

const uk = {
      lang: "uk",
      errorDb: "Помилка. Повторіть спробу пізніше.",
      register: {
            createAccount: "Створити обліковий запис",
            username: "Ім'я користувача",
            errorUsername: "Користувач з таким ім'ям вже існує",
            email: "Електронна пошта",
            errorEmail: "Така електронна пошта вже зареєстрована",
            password: "Пароль",
            haveAnAccount: "Вже зареєстровані?",
            login: "Увійти"
      },
      login: {
            login: "Увійти",
            loginData: "Ім'я користувача або електронна пошта",
            errorUsername: "Користувача з таким ім'ям/поштою не знайдено",
            password: "Пароль",
            errorPassword: "Неправильний пароль",
            doNotHaveAccount: "Не зареєстровані?",
      },
      home: {
            profile: "Профіль",
            navigation: "Зміст",
            forYou: "Для Вас",
            Adventure: "Пригоди",
            Classic: "Класика",
            Comedy:"Комедія",
            Dystopian:"Утопія",
            Fantasy:"Фентезі",
            Fiction:"Художня",
            Gothic:"Готика",
            Historical:"Історична",
            Horror:"Жахи",
            Mystery:"Містика",
            Nonfiction:"Нон-фікшн",
            Philosophical:"Філософська",
            Poetry:"Поезія",
            Romance:"Романтика",
            Satire:"Сатира",
            Thriller:"Трилер",
            'Young Adult':"Для підлітків",
            topPicks:"Підібране для Вас!",
            read: "Читати книгу",
            updateRecsRead:"Оновити реокмендації (за прочитаним)",
            updateQuiz: "Пройти опитування",
            updateRecsLiked:"Оновити рекомендації за вподобаннями",
            noBooks:"Рекомендації літератури недоступні",
            booksByGenre:"Література за жанрами",
            author:"Автор",
            description:"Опис",
            genre:"Жанр",
            year:"Рік",
            pages:"Сторінок",
            language:"Мова"
      },
      quiz: {
            heading: "Пройдіть опитування для завершення реєстрації",
            questionBookLength: "Книги якої довжини Вам подобаються?",
            answer1BookLength: "До 400 сторінок",
            answer2BookLength: "400 - 800 сторінок",
            answer3BookLength: "Більше ніж 800 сторінок",
            questionBookYear: "Книгам якого року видання Ви надаєте перевагу?",
            answer1BookYear: "1800 - 1900",
            answer2BookYear: "1901 - 2000",
            answer3BookYear: "2001 - 2025",
            questionGenres: "Оберіть улюблені жанри:",
            genreError: "Будь ласка, оберіть хоч один жанр.",
            questionLanguages: "Оберіть мови:",
            languageError: "Будь ласка, оберіть хоч одну мову.",
            submit: "Завершити опитування"
      },
      quizReevaluation: {
            heading: "Отримайте більш точні рекомендації, пройшовши опитування!",
            questionWeightLength: "Наскільки важливий обсяг книги для Вас?",
            questionWeightHint: "1 - мало важливий, 10 - дуже важливий",
            questionWeightYear: "Наскільки важливий рік видання книги?",
            questionWeightGenre: "Наскільки важливий жанр книги?",
            questionWeightLanguage: "Наскільки важлива мова книги?",  
            unselectedError: "Виберіть опцію"
      },
      profile: {
            savedBooks: "Обрані книги",
            readBooks: "Прочитані книги",
            personalData: "Особисті дані",
            logOut: "Вийти",
            yourSavedBooks: "Ваші обрані книги",
            yourReadBooks: "Ваші прочитані книги",
            noBooks: "Ви ще не додали жодну книгу до обраного...",
            edit: "Редагувати профіль",
            languagePrefs: "Вподобання мови: ",
            cancel: "Скасувати",
            save: "Зберегти",
      },
      dbGenres: {
            Mystery: "Містика",
            Romance: "Романтика",
            Adventure: "Пригоди",
            Fantasy: "Фентезі",
            Historical: "Історична",
      },
      dbLanguages: {
            English: "Англійська",
            Ukrainian: "Українська"
      },
      "The Great Gatsby": {
            title: "Великий Гетсбі",
            author: "Ф. Скотт Фіцджеральд",
            description: "Роман, що розповідає про багатство, любов і американську мрію в епоху Ревучих двадцятих."
      },
      "The Book Thief": {
            title: "Крадійка книжок",
            author: "Маркус Зузак",
            description: "Історичний роман, що розгортається під час Другої світової війни, про життя молодої дівчини в нацистській Німеччині."
      },
      "The Time Travelers Wife": {
            title: "Дружина мандрівника в часі",
            author: "Одрі Ніффенеггер",
            description: "Роман про любовну історію між Клер і Генрі, які повинні подолати труднощі у своїх стосунках через неконтрольовану подорож у часі Генрі. Роман досліджує любов, втрату та плинність часу."
      }, 
      "Pride and Prejudice": {
            title: "Гордість і упередження",
            author: "Джейн Остін",
            description: "Романтичний роман про суспільні очікування щодо жінок на початку 19 століття."
      },
      "Before the Coffee Gets Cold": {
            title: "Перед тим, як кава охолоне",
            author: "Тосікадзу Кавагуті",
            description: "У невеликому прихованому токійському кафе клієнти мають можливість подорожувати в часі, але лише до тих пір, поки їхня кава залишається теплою. Цей зворушливий і спонукаючий до роздумів роман досліджує теми кохання, жалю та другого шансу через переплетіння історій людей."
      },
      "Frankenstein": {
            title: "Франкенштейн",
            author: "Мері Шеллі",
            description: "Готичний роман про вченого, який створює життя. "
      },
      "Shadows of Forgotten Ancestors": {
            title: "Тіні забутих предків",
            author: "Михайло Коцюбинський",
            description: "Повість, що поєднує реальність та фантастичні елементи, розповідаючи про життя гуцулів в Карпатах."
      },
      "Tiger Catchers": {
            title: "Тигролови",
            author: "Іван Багряний",
            description: "Захопливий пригодницький роман про втечу українця з радянського поїзда та виживання в тайзі."
      },
      "The Girl with the Dragon Tattoo": {
            title: "Дівчина з татуюванням дракона",
            author: "Стіг Ларссон",
            description: "Сучасний трилер про хакера, який розслідує справу багатої родини."
      },
      "Gone with the Wind": {
            title: "Віднесені вітром",
            author: "Маргарет Мітчелл",
            description: "Романтичний історичний роман, дія якого розгортається під час Громадянської війни в США."
      },
      "Moby-Dick": {
            title: "Мобі Дік",
            author: "Герман Мелвілл",
            description: "Роман про нав'язливе прагнення капітана помститися киту."
      },
      "The Chronicles of Narnia": {
            title: "Хроніки Нарнії",
            author: "К.С. Льюїс",
            description: "Серія фентезійних романів, дія яких відбувається в чарівній країні Нарнія."
      },                                                                                                                                                                                                                                                                   
      "The Fault in Our Stars": {
            title: "Винні зірки",
            author: "Джон Грін",
            description: "Роман про двох підлітків з раком, які закохуються один в одного."
      },
      "Percy Jackson and The Olympians: The Lightning Thief": {
            title: "Персі Джексон та викрадач блискавок",
            author: "Рік Ріордан",
            description: "Персі Джексон, дванадцятирічний хлопець, дізнається, що він син Посейдона і його звинувачують у крадіжці блискавки Зевса. Щоб запобігти війні серед богів, він вирушає в небезпечну подорож, сповнену міфологічних істот."
      },
      "The Hobbit": {
            title: "Гобіт",
            author: "Дж.Р.Р. Толкін",
            description: "Фентезійний роман про Більбо Беггінса та його подорож з гномами."
      },
      "The Kite Runner": {
            title: "Ловець повітряних зміїв",
            author: "Халед Хоссейні",
            description: "Роман про дружбу і спокути, дія якого розгортається в Афганістані."
      },
      "The Lord of the Rings": {
            title: "Володар перснів",
            author: "Дж.Р.Р. Толкін",
            description: "Епічна фентезійна трилогія про подорож для знищення Персня."
      },
      "The Metamorphosis": {
            title: "Перетворення",
            author: "Франц Кафка",
            description: "Новела про людину, яка перетворюється на велетенську комаху."
      },
      "Amadoka": {
            title: "Амадока",
            author: "Софія Андрухович",
            description: "Глибокий роман про пам'ять, ідентичність та приховані рани української історії."
      },
      "The Picture of Dorian Gray": {
            title: "Портрет Доріана Грея",
            author: "Оскар Вайльд",
            description: "Філософський роман про чоловіка, портрет якого старіє замість нього."
      },
      "The Shining": {
            title: "Сяйво",
            author: "Стівен Кінг",
            description: "Роман жахів про готель з привидами та хлопчика з екстрасенсорними здібностями."
      },
      "The Name of the Wind": {
            title: "Ім'я вітру",
            author: "Патрік Ротфусс",
            description: "Фентезійний роман про Квоут, талановитого музиканта і магістра, який розповідає свою історію."
      },
      "Night": {
            title: "Ніч",
            author: "Елі Візель",
            description: "Мемуари Елі Візеля про виживання в нацистських концтаборах, що зображують неймовірні жахіття та втрати. Його історія досліджує віру, витривалість і здатність людини як до жорстокості, так і до доброти."
      },
      "The White Ash": {
            title: "Білий попіл",
            author: "Ілларіон Павлюк",
            description: "Приватному детективу Тарасу Білому замовляють розслідувати вбивство панночки. Обвинувачують такого собі семінариста Хому Брута, й справа ніби геть зрозуміла... Втім, хутір, де сталося вбивство, приховує таємницю. І ця таємниця - страшніша за всі оповідки про панночку, яка встала з гробу."
      },
      "The Old Man and the Sea": {
            title: "Старий і море",
            author: "Ернест Хемінгуей",
            description: "Короткий роман про боротьбу старого рибалки з велетенським марліном."
      },
      "Me Before You": {
            title: "До зустрічі з тобою",
            author: "Джоджо Моєс",
            description: "Луїза Кларк стає доглядальницею Вілла Трейнора, чоловіка, що залишився паралізованим після аварії. Їхній зв'язок стає глибшим, і вона намагається довести йому, що життя все ще має сенс."
      },
      "11,22,63": {
            title: "11/22/63",
            author: "Стівен Кінг",
            description: "Напружений роман про чоловіка, який отримує шанс запобігти вбивству Джона Ф. Кеннеді. Однак зміни в минулому можуть призвести до непередбачуваних наслідків."
      },
      "Small Things Like These": {
            title: "Малі речі як ці",
            author: "Клер Кіган",
            description: "Дія відбувається в Ірландії 1985 року. Головний герой, вугільник, стикається з темною таємницею монастиря, що змушує його переосмислити свої моральні цінності."
      },
      "The Ocean at the End of the Lane": {
            title: "Океан біля кінця вулиці",
            author: "Ніл Ґейман",
            description: "Чоловік повертається в рідне місто і згадує пригоди з дитинства, що включають таємничу дівчину, стародавню силу і магічні події."
      },
      "The Strange Case of Dr. Jekyll and Mr. Hyde": {
            title: "Дивна історія доктора Джекила і містера Гайда",
            author: "Роберт Луїс Стівенсон",
            description: "Новела про двоїстість людської природи, що розповідає про доктора Джекила, шанованого лікаря, який створює зілля, що перетворює його на злодійського містера Гайда."
      },
      "The Way of St. James": {
            title: "Дорога святого Якова",
            author: "Дзвінка Матіяш",
            description: "Каміно-де-Сантьяго, або ж дорога святого Якова - це 900 кілометрів пішки з наплічником на спині через усю Іспанію до міста Сантьяго-де-Компостела і до мису Фіністерра - Кінця Землі. Це унікальний досвід, який авторка книжки переживає разом зі своїм чоловіком."
      },
      "The Martian": {
            title: "Марсіанин",
            author: "Енді Вір",
            description: "Напружена історія виживання про астронавта Марка Вотні, який опиняється сам на Марсі після невдалої місії. З обмеженими ресурсами він змушений покладатися на свій розум і наукові знання, щоб вижити в очікуванні можливого порятунку."
      },
      "The Little Prince": {
            title: "Маленький принц",
            author: "Антуан де Сент-Екзюпері",
            description: "Філософська казка про маленького принца, який подорожує від планети до планети, зустрічаючи різних дивних жителів."
      },
      "The Grapes of Wrath": {
            title: "Грона гніву",
            author: "Джон Стейнбек",
            description: "Роман, дія якого відбувається під час Великої депресії, слідкує за родиною Джоад, яка вирушає на захід з Оклахоми до Каліфорнії в пошуках кращого життя, стикаючись з жорстокими економічними та соціальними труднощами."
      },
      "The Woman in White": {
            title: "Жінка в білому",
            author: "Вілкі Коллінз",
            description: "Готичний детектив про жінку, яку замкнули в психіатричній лікарні, і таємниці, що оточують її загадкове зникнення. Історія розповідається з кількох точок зору, що додає інтригу."
      },
      "Jane Eyre": {
            title: "Джейн Ейр",
            author: "Шарлотта Бронте",
            description: "Історія сироти, яка стає гувернанткою та закохується у свого роботодавця, містера Рочестера. Роман досліджує теми незалежності, моралі та кохання в суспільстві, яке обмежує свободу жінок."
      },
      "The Scarlet Letter": {
            title: "Червона літера",
            author: "Натаніель Готорн",
            description: "Історичний роман, дія якого відбувається в пуританській Америці XVII століття, про Гестер Прінн, яку ганьблять за перелюб. Роман досліджує теми провини, гріха і спокути в жорсткому суспільстві."
      },
      "Sweet Darysya": {
            title: "Солодка Даруся",
            author: "Марія Матіос",
            description: "Трагедія дівчини, чия доля нерозривно пов'язана з радянськими репресіями на Західній Україні."
      },
      "The Count of Monte Cristo": {
            title: "Граф Монте-Крісто",
            author: "Александр Дюма",
            description: "Едмон Дантес несправедливо ув`язнений, але втікає та повертається як багатий граф Монте-Крісто. Одержимий помстою, він ретельно планує знищення тих, хто його зрадив. Цей роман - шедевр пригод, справедливості та відплати."
      },
      "The Taste of Apple Seeds": {
            title: "Смак яблучних кісточок",
            author: "Катарина Хагена",
            description: "Ліричний роман про жінку, яка успадковує бабусин дім і відкриває приховані родинні спогади."
      }
};
  
  export default uk;
  